In [1]:
import pandas as pd
import numpy as np

# 5.1 Introduction to pandas Data Structures

### Series

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [6]:
# Often it will be desirable to create a Series with an index indetifying each data point with a label:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# Compared with NumPy Arays, you can use labels in the index when selecting single values or a set of values:
obj2['a']

-5

In [9]:
# Here ['c', 'a', 'd'] is interpreted as a list of indices, even though it contains strings instead of integers.
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
# Using NumPy functions or NumPy-like operations, such as filtering with a boolean array, scalar multiplication,
# or applying math functions, will preserve the index-value link:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
# Another way to think about a Series is as a fixed-length, ordered dict, as it is a map‐ ping of index values to data values.
# It can be used in many contexts where you might use a dict:
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
# Should you have data contained in a Python dict, you can create a Series from it by passing the dict:
sdata = {'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
# When you are only passing a dict, the index in the resulting Series will have the dict’s keys in sorted order.
# You can override this by passing the dict keys in the order you want them to appear in the resulting Series:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

# Here, three values found in sdata were placed in the appropriate locations, but since no value for 'California' was found,
# it appears as NaN (not a number), which is con‐ sidered in pandas to mark missing or NA values.
# Since 'Utah' was not included in states, it is excluded from the resulting object.

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
# I will use the terms “missing” or “NA” interchangeably to refer to missing data.
# The isnull and notnull functions in pandas should be used to detect missing data:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [19]:
# Series also has these as instance methods:
obj4.isnull()
# This is dicussed more in Chapter 7; working with missing data

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
# A useful Series feature for many applications is that it automatically aligns by index
# label in arithmetic operations:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
obj3 + obj4
# Data alignment features will be addressed in more detail later.
# If you have experience with databases, you can think about this as being similar to a join operation.

California         NaN
Ohio            7000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
# Both the Series object itself and its index have a name attribute,
# which integrates with other key areas of pandas functionality:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [24]:
# A Series's index can be altered in-place by assignment:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [25]:
# This is us altering the index an replacing it with strings instead of numbers:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [26]:
# There are many ways to construct a DataFrame, though one of the most common is
# from a dict of equal-length lists or NumPy arrays:
data = {'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
        'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003]
        }
frame = pd.DataFrame(data)

In [27]:
frame
# The resulting DataFrame will have its index assigned automatically as with Series, and
# the columns are placed in sorted order:

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [28]:
# If you are using the Jupyter notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table.
# For large DataFrames, the head method selects only the first five rows:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
# If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
# If you pass a column that isn’t contained in the dict, it will appear with missing values in the result:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                              'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [32]:
# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [33]:
frame.year
# frame2[column] works for any column name, but frame2.column only works
# when the column name is a valid Python variable name.

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [34]:
# Note that the returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.
# Rows can also be retrieved by position or name with the special loc attribute (much more on this later):
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
# Columns can be modified by assignment. For example, the empty 'debt' column could be assigned a scalar value or an array of values:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [36]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [37]:
# When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame.
# If you assign a Series, its labels will be realigned exactly to the DataFrame’s index,
# inserting missing values in any holes:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [38]:
# Assigning a column that doesn’t exist will create a new column. The del keyword will delete columns as with a dict.
# As an example of del, I first add a new column of boolean values where the state column equals 'Ohio':
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [39]:
# New columns cannot be created with the frame2.eastern syntax.
# The del method can then be used to remove this column:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
# The column returned from indexing a DataFrame is a view on the underlying data, not a copy.
# Thus, any in-place modifications to the Series will be reflected in the DataFrame.
# The column can be explicitly copied with the Series’s copy method.
# Another common form of data is a nested dict of dicts:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [41]:
# If the nested dict is passed to the DataFrame, pandas will interpret
# the outer dict keys as the columns and the inner keys as the row indices:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [42]:
# You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [43]:
# The keys in the inner dicts are combined and sorted to form the
# index in the result. This isn’t true if an explicit index is specified:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
# Dicts of Series are treated in much the same way:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)
# For a complete list of things you can pass the DataFrame constructor, see Table 5-1.

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [45]:
# If a DataFrame’s index and columns have their name attributes set, these will also be displayed:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [46]:
# As with Series, the values attribute returns the data contained in the DataFrame as a two-dimensional ndarray:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [47]:
# If the DataFrame’s columns are different dtypes, the dtype of the
# values array will be chosen to accommodate all of the columns:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [48]:
# Index objects are immutable and thus can’t be modified by the user:
# index[1] = 'd' # TypeError

In [49]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [50]:
index[1:]

Index(['b', 'c'], dtype='object')

In [51]:
# Immutability makes it safer to share Index objects among data structures:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [52]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [53]:
obj2.index is labels

True

In [54]:
# In addition to being array-like, an Index also behaves like a fixed-size set:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [55]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [56]:
'Ohio' in frame3.columns

True

In [57]:
2003 in frame3.index

False

In [58]:
# Unlike Python sets, a pandas Index can contain duplicate labels:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [59]:
# Assigning a column that doesn’t exist will create a new column. The del keyword will delete columns as with a dict.
# As an example of del, I first add a new column of boolean values where the state column equals 'Ohio':
frame2['eastern'] = frame2.state == 'Ohio'
frame2
# New columns cannot be created with the frame2.eastern syntax.

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [60]:
# The del method can then be used to remove this column:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
# Another common form of data is a nested dict of dicts:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# If the nested dict is passed to the DataFrame, pandas will interpret the outer
# dict keys as the columns and the inner keys as the row indices:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
# An important method on pandas objects is reindex, which means to create
# a new object with the data conformed to a new index. Consider an example:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [63]:
# Calling reindex on this Series rearranges the data according to the new index,
# intro‐ ducing missing values if any index values were not already present:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [64]:
#  For ordered data like time series, it may be desirable to do some interpolation or fill‐ ing of
# values when reindexing. The method option allows us to do this, using a method
# such as ffill, which forward-fills the values:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [65]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [66]:
# With DataFrame, reindex can alter either the (row) index, columns, or both.
# When passed only a sequence, it reindexes the rows in the result:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [67]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [68]:
# The columns can be reindexed with the columns keyword:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [69]:
# See Table 5-3 for more about the arguments to reindex.

# As we’ll explore in more detail, you can reindex more succinctly by label-indexing
# with loc, and many users prefer to use it exclusively:

# frame.loc[['a', 'b', 'c', 'd'], states]

In [70]:
# Dropping one or more entries from an axis is easy if you already have an index array or list without those entries.
# As that can require a bit of munging and set logic, the drop method will return a new object with the indicated 
# value or values deleted from an axis:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'e'])
obj

a    0
b    1
c    2
e    3
dtype: int64

In [71]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
e    3
dtype: int64

In [72]:
obj.drop(['b', 'c'])

a    0
e    3
dtype: int64

In [73]:
# With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0):
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
# You can drop values from the columns by passing axis=1 or axis='columns':
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [76]:
# Many functions, like drop, which modify the size or shape of a Series or DataFrame,
# can manipulate an object in-place without returning a new object:
obj.drop('c', inplace=True)
obj
# Be careful with the inplace, as it destroys any data that is dropped.

a    0
b    1
e    3
dtype: int64

In [77]:
# Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead
# of only integers. Here are some examples of this:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [78]:
obj['b']

1.0

In [79]:
# iloc is prefered here since the first one is to be depricated
obj[1]
obj.iloc[1]

/var/folders/7d/177p5yjd3691b3ytzr0fwn_00000gp/T/ipykernel_13898/964500322.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [80]:
# These are the same, it is preferred to use iloc
obj[2:4]
obj.iloc[2:4]

c    2.0
d    3.0
dtype: float64

In [81]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [82]:
# Same thing, just the first one will be depricated
obj[[1, 3]]
obj.iloc[[1, 3]]

/var/folders/7d/177p5yjd3691b3ytzr0fwn_00000gp/T/ipykernel_13898/1151079275.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [83]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [84]:
# Slicing with labels behaves differently than normal Python slicing in that the end‐
# point is inclusive:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [85]:
# Setting using these methods modifies the corresponding section of the Series:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [86]:
# Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [88]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [89]:
# Indexing like this has a few special cases. First, by slicing
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
# And second, selecting data with a boolean array:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
# The row selection syntax data[:2] is provided as a convenience. Passing a single ele‐ ment or a list to the [] operator selects columns.

# Another use case is in indexing with a boolean DataFrame, such as one produced by a scalar comparison:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data < 5] = 0
data
# This makes DataFrame syntactically more like a two-dimensional NumPy array in this particular case.

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
# For DataFrame label-indexing on the rows, I introduce the special 
# indexing operators loc and iloc. They enable you to select a subset of
# the rows and columns from a DataFrame with NumPy-like notation using either
# axis labels (loc) or integers (iloc).

# As a preliminary example, let’s select a single row and multiple columns by label:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [94]:
# We’ll then perform some similar selections with integers using iloc:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [95]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [96]:
data.iloc[[1,2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [97]:
# Both indexing functions work with slices in addition to single labels or lists of labels:
data.loc['Utah', 'two']

9

In [98]:
data.iloc[:, :3][data.three > 5]
# So there are many ways to select and rearrange the data contained in a pandas object.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [99]:
# Working with pandas objects indexed by integers is something that often
# trips up new users due to some differences with indexing semantics on built-in Python
# data structures like lists and tuples. For example, you might not expect the following code to generate an error:
ser = pd.Series(np.arange(3.))
ser
# ser[-1] # KeyError

0    0.0
1    1.0
2    2.0
dtype: float64

In [100]:
# On the other hand, with a non-integer index, there is no potential for ambiguity:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2.iloc[-1]

2.0

In [101]:
# To keep things consistent, if you have an axis index containing integers, data selection will always
# be label-oriented. For more precise handling, use loc (for labels) or iloc (for integers):
ser[:1]
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [102]:
ser.iloc[:1]

0    0.0
dtype: float64

In [103]:
# An important pandas feature for some applications is the behavior of
# arithmetic between objects with different indexes. When you are adding together objects,
# if any index pairs are not the same, the respective index in the result will be the union of the index pairs.
# For users with database experience, this is similar to an automatic outer join on the index labels. Let’s look at an example:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [104]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [105]:
# Adding these together yields:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [106]:
# The internal data alignment introduces missing values in the label locations that don’t overlap.
# Missing values will then propagate in further arithmetic computations.
# In the case of DataFrame, alignment is performed on both the rows and the columns:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [107]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [108]:
# Adding these together returns a DataFrame whose index and columns are the unions of the ones in each DataFrame:
df1 + df2
# Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear as all missing in the result.
# The same holds for the rows whose labels are not common to both objects.

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [109]:
# If you add DataFrame objects with no column or row labels in common, the result will contain all nulls:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1

   A
0  1
1  2

In [110]:
df2

   B
0  3
1  4

In [111]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [112]:
# In arithmetic operations between differently indexed objects, you might want to fill with a special value,
# like 0, when an axis label is found in one object but not the other:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd')) # Makes a list out of the string making sing the list function
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde')) # same is done here to make a list
df2.loc[1, 'b'] = np.nan

In [113]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [114]:
# Adding these together results in NA values in the locations that don’t overlap:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [115]:
# Using the add method on df1, I pass df2 and an argument to fill_value:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [117]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [118]:
# Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [119]:
# As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also defined.
# First, as a motivating example, consider the difference between a two-dimensional array and one of its rows:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [120]:
arr[0]

array([0., 1., 2., 3.])

In [121]:
# When we subtract arr[0] from arr, the subtraction is performed once for each row.
# This is referred to as broadcasting and is explained in more detail as it relates to general
# NumPy arrays in Appendix A.
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [122]:
# Operations between a DataFrame and a Series are similar:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [123]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [124]:
# By default, arithmetic between DataFrame and Series matches the index of the
# Series on the DataFrame’s columns, broadcasting down the rows:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [125]:
# If an index value is not found in either the DataFrame’s columns or the
# Series’s index, the objects will be reindexed to form the union:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [126]:
# If you want to instead broadcast over the columns, matching on the rows,
# you have to use one of the arithmetic methods. For example:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [128]:
# The axis number that you pass is the axis to match on. In this case we mean to match on the
# DataFrame’s row index (axis='index' or axis=0) and broadcast across.
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [129]:
# NumPy ufuncs (element-wise array methods) also work with pandas objects:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.890241  1.636535  0.610695
Ohio    0.066204 -0.431705 -2.131937
Texas   0.095755 -0.234383 -1.088414
Oregon -2.156139 -1.020232 -0.462422

In [130]:
np.abs(frame)

               b         d         e
Utah    0.890241  1.636535  0.610695
Ohio    0.066204  0.431705  2.131937
Texas   0.095755  0.234383  1.088414
Oregon  2.156139  1.020232  0.462422

In [131]:
# Another frequent operation is applying a function on one-dimensional
# arrays to each column or row. DataFrame’s apply method does exactly this:
f = lambda x: x.max() - x.min()
frame.apply(f)
# Here the function f, which computes the difference between the maximum and mini‐ mum of a
# Series, is invoked once on each column in frame. The result is a Series hav‐ ing the columns of frame as its index.

b    2.251894
d    2.656767
e    2.742632
dtype: float64

In [132]:
# If you pass axis='columns' to apply, the function will be invoked once per row instead:
frame.apply(f, axis='columns')

Utah      2.526776
Ohio      2.198141
Texas     1.184169
Oregon    1.693718
dtype: float64

In [133]:
# Many of the most common array statistics (like sum and mean) are DataFrame meth‐ ods, so using apply is not necessary.
# The function passed to apply need not return a scalar value; it can also return a Series with multiple values:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -2.156139 -1.020232 -2.131937
max  0.095755  1.636535  0.610695

In [134]:
# Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted
# string from each floating-point value in frame. You can do this with apply map:
format = lambda x: '%.2f' % x
# These are the same thing, but apply.map 
# frame.applymap(format)
frame.map(format)

            b      d      e
Utah    -0.89   1.64   0.61
Ohio     0.07  -0.43  -2.13
Texas    0.10  -0.23  -1.09
Oregon  -2.16  -1.02  -0.46

In [135]:
# The reason for the name applymap is that Series has a map method for applying an element-wise function:
frame['e'].map(format)

Utah       0.61
Ohio      -2.13
Texas     -1.09
Oregon    -0.46
Name: e, dtype: object

In [136]:
# Sorting a dataset by some criterion is another important built-in operation. To sort lexicographically by row or column index,
# use the sort_index method, which returns a new, sorted object:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [137]:
# With a DataFrame, you can sort by index on either axis:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [138]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [139]:
# The data is sorted in ascending order by default, but can be sorted in descending order, too:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [140]:
# To sort a Series by its values, use its sort_values method:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [141]:
# Any missing values are sorted to the end of the Series by default:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [142]:
# When sorting a DataFrame, you can use the data in one or more columns as the sort keys.
# To do so, pass one or more column names to the by option of sort_values:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [143]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [144]:
# To sort by multiple columns, pass a list of names:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [145]:
# Ranking assigns ranks from one through the number of valid data points in an array.
# The rank methods for Series and DataFrame are the place to look; by default rank breaks
# ties by assigning each group the mean rank:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [146]:
# Ranks can also be assigned according to the order in which they’re observed in the data:
obj.rank(method='first')
# Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7
# because label 0 precedes label 2 in the data.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [147]:
# You can rank in descending order, too:

# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')
# See Table 5-6 for a list of tie-breaking methods available.

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [148]:
# DataFrame can compute ranks over the rows or the columns:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [149]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [150]:
# Up until now all of the examples we’ve looked at have had unique axis labels (index values).
# While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory.
# Let’s consider a small Series with duplicate indices:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [151]:
# The index’s is_unique property can tell you whether its labels are unique or not:
obj.index.is_unique

False

In [152]:
# Data selection is one of the main things that behaves differently with duplicates. 
# Indexing a label with multiple entries returns a Series, while single entries return a scalar value:
obj['a']

a    0
a    1
dtype: int64

In [153]:
obj['c']
# This can make your code more complicated, as the output type from indexing can
# vary based on whether a label is repeated or not.

4

In [154]:
# The same logic extends to indexing rows in a DataFrame:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.796164  1.414928  0.694592
a -0.601156  0.454436 -0.927150
b -0.112191  0.745505  0.580136
b -0.396279 -0.986828 -0.270810

In [155]:
# pandas objects are equipped with a set of common mathematical and statistical meth‐ ods. 
# Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean)
# from a Series or a Series of values from the rows or columns of a DataFrame. Compared with the similar methods found on NumPy arrays,
# they have built-in handling for missing data. Consider a small DataFrame:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                    index=['a', 'b', 'c', 'd'],
                    columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [156]:
# Calling DataFrame’s sum method returns a Series containing column sums:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [157]:
# Passing axis='columns' or axis=1 sums across the columns instead:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [158]:
# NA values are excluded unless the entire slice (row or column in this case) is NA.
# This can be disabled with the skipna option:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [159]:
# Some methods, like idxmin and idxmax, return indirect statistics like
# the index value where the minimum or maximum values are attained:
df.idxmax()

one    b
two    d
dtype: object

In [160]:
# Other methods are accumulations:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [161]:
# Another type of method is neither a reduction nor an accumulation.
# describe is one such example, producing multiple summary statistics in one shot:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [162]:
# On non-numeric data, describe produces alternative summary statistics:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()
# See Table 5-8 for a full list of summary statistics and related methods.

count     16
unique     3
top        a
freq       8
dtype: object

In [163]:
import yfinance as yf

In [164]:
# Define the list of tickers
tickers = ['AAPL', 'IBM', 'MSFT', 'GOOG']

# Fetch data for each ticker using a dictionary comprehension
all_data = {ticker: yf.download(ticker, start='2022-01-01', end='2023-01-01')
            for ticker in tickers}

# Create a DataFrame for 'Adj Close' prices
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})

# Create a DataFrame for 'Volume' data
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [166]:
# I now compute percent changes of the prices, a time series operation which will be explored further in Chapter 11:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-12-23 -0.002798  0.005466  0.002267  0.017562
2022-12-27 -0.013878  0.005436 -0.007414 -0.020933
2022-12-28 -0.030685 -0.016851 -0.010255 -0.016718
2022-12-29  0.028324  0.007427  0.027630  0.028799
2022-12-30  0.002469 -0.001205 -0.004938 -0.002473

In [169]:
# The corr method of Series computes the correlation of the overlapping, non-NA,
# aligned-by-index values in two Series. Relatedly, cov computes the covariance:
returns['MSFT'].corr(returns['IBM'])

0.43026762381049954

In [171]:
returns['MSFT'].cov(returns['IBM'])

0.00014406149018342989

In [172]:
# Since MSFT is a valid Python attribute, we can also select these columns using more concise syntax:
returns.MSFT.corr(returns.IBM)

0.43026762381049954

In [173]:
# DataFrame’s corr and cov methods, on the other hand, return a full correlation or covariance matrix as a DataFrame, respectively:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.489356  0.824902  0.790573
IBM   0.489356  1.000000  0.430268  0.382440
MSFT  0.824902  0.430268  1.000000  0.845283
GOOG  0.790573  0.382440  0.845283  1.000000

In [174]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000505  0.000165  0.000413  0.000435
IBM   0.000165  0.000226  0.000144  0.000141
MSFT  0.000413  0.000144  0.000497  0.000461
GOOG  0.000435  0.000141  0.000461  0.000599

In [175]:
# Using DataFrame’s corrwith method, you can compute pairwise correlations between a DataFrame’s columns or rows
# with another Series or DataFrame. Passing a Series returns a Series with the 
# correlation value computed for each column:
returns.corrwith(returns.IBM)

AAPL    0.489356
IBM     1.000000
MSFT    0.430268
GOOG    0.382440
dtype: float64

In [177]:
# Passing a DataFrame computes the correlations of matching column names. Here I compute correlations of percent changes with volume:
returns.corrwith(volume)
# Passing axis='columns' does things row-by-row instead. In all cases,
# the data points are aligned by label before the correlation is computed.

AAPL   -0.009583
IBM     0.043521
MSFT   -0.055300
GOOG   -0.066087
dtype: float64

In [179]:
# Another class of related methods extracts information about the values contained in a one-dimensional Series.
# To illustrate these, consider this example
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
# The first function is unique, which gives you an array of the unique values in a Series:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [180]:
# The unique values are not necessarily returned in sorted order, but could be sorted after the fact if needed (uniques.sort()).
# Relatedly, value_counts computes a Series containing value frequencies:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [183]:
pd.value_counts(obj.values, sort=False)

/var/folders/7d/177p5yjd3691b3ytzr0fwn_00000gp/T/ipykernel_13898/3084372382.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [185]:
# isin performs a vectorized set membership check and can be useful in filtering a
# dataset down to a subset of values in a Series or column in a DataFrame:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [188]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [189]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [190]:
# Related to isin is the Index.get_indexer method, which gives you an index array from an
# array of possibly non-distinct values into another array of distinct values:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [191]:
#In some cases, you may want to compute a histogram on multiple
# related columns in a DataFrame. Here’s an example:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [197]:
# Passing pandas.value_counts to this DataFrame’s apply function gives:
result = data.apply(pd.value_counts).fillna(0)
result

/var/folders/7d/177p5yjd3691b3ytzr0fwn_00000gp/T/ipykernel_13898/1875475485.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0